Documents/Резервирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Резервирование</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыРезервирований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТабличнойЧасти</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТабличнойЧасти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>#9777</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыТабличнойЧасти.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыТабличнойЧасти</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Резервирование/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//#12337
	Для Индекс = 0 по Товары.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Товары[Индекс];
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + Строка(Индекс+1) + " выбрана номенклатура-услуга", ЭтотОбъект, "Товары["+Формат(Индекс, "ЧГ=0")+"].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи, "Резервирование");
	
	//++ №10312 запрещаем помечать на удаление и отменять проведение, если по документу резерва списали резервы
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись И ПометкаУдаления) 
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Если ЕстьСписанныеРезервыПоДокументуРезерва() Тогда
			Сообщить("Действие отменено.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	//-- №10312
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	// Проверим а есть ли позиции в документе резерва, вычтем уже зарезервированные и уже реализованные, чтобы не дать поставить в резерв больше чем положено
	Отказ = НЕ ПроверитьНаличиеВДокументеРезерваИОтгрузкиСРезервами();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, Товары, Дата, Истина);
	Если Отказ Тогда
		Возврат;
	Иначе
		Для Каждого Товар Из Товары Цикл
			Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ДокументРезерва = ДокументРезерва;
			Движение.Организация = ОрганизацияТоваров;
			Движение.Склад = Склад;			
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Движение.ВидТабличнойЧасти = Товар.ВидТабличнойЧасти;
			Движение.Количество = Товар.Количество * Товар.Коэффициент;			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения, , "Резервирование");
	
	Контрагент 		= ДанныеЗаполнения.Контрагент;
	Организация 	= ДанныеЗаполнения.Организация;
	Склад 	 		= ДанныеЗаполнения.Склад;
	ДокументРезерва = ДанныеЗаполнения;
	
	СписокКЗаполнению = Документы.Резервирование.ПолучитьСписокТоваровКЗаполнению(ДанныеЗаполнения, Ссылка);
	
	Для Каждого ТекущаяСтрока Из СписокКЗаполнению Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);		
	КонецЦикла;
	
	СкорректироватьНаличиеВДокументеРезерваИОтгрузкиСРезервами();
		
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СкорректироватьНаличиеВДокументеРезерваИОтгрузкиСРезервами()
	
	ВТ_Товары = Товары.Выгрузить();
	Для Каждого ТекущаяСтрока Из ВТ_Товары Цикл
		ТекущаяСтрока.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
	КонецЦикла;
	ВТ_Товары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ВидТабличнойЧасти", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокументаРезерва", Дата);
	Запрос.УстановитьПараметр("Товары", ВТ_Товары);
	Запрос.УстановитьПараметр("ДокументРезерва", ДокументРезерва);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ЭтоЗаказПокупателя", ТипЗнч(ДокументРезерва) = Тип("ДокументСсылка.ЗаказПокупателя"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры,
	|	Товары.ВидТабличнойЧасти,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК КРезервированию
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВРезервеНаСкладах.Номенклатура,
	|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладах.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ТоварыВРезервеНаСкладах.КоличествоПриход), 0) - ЕСТЬNULL(СУММА(ТоварыВРезервеНаСкладах.КоличествоРасход), 0) КАК УжеВРезерве	
	|
	|ПОМЕСТИТЬ ВТ_ТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(,, Регистратор, ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезервеНаСкладах
	|ГДЕ
	|   НЕ ТоварыВРезервеНаСкладах.Регистратор = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладах.Номенклатура,
	|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладах.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	Значение(Перечисление.ВидыТабличнойЧасти.Товары) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Коэффициент), 0) КАК Количество
	|
	|ПОМЕСТИТЬ ВТ_ТоварыЗаказаПокупателя
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|   ЗаказПокупателяТовары.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МонтажТовары.Номенклатура,
	|	МонтажТовары.ХарактеристикаНоменклатуры,
	|	МонтажТовары.СерияНоменклатуры,
	|	Значение(Перечисление.ВидыТабличнойЧасти.Товары) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(МонтажТовары.Количество * МонтажТовары.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА МонтажТовары.Ссылка.Результат В (Значение(Справочник.РезультатыМонтажа.Выполнен), Значение(Справочник.РезультатыМонтажа.Закрыт))
	|			ТОГДА ЕСТЬNULL(СУММА(МонтажТовары.Количество * МонтажТовары.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|
	|ПОМЕСТИТЬ ВТ_ПозицииМонтажа
	|
	|ИЗ
	|	Документ.Монтаж.ТоварыУслуги КАК МонтажТовары
	|ГДЕ
	|   МонтажТовары.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	МонтажТовары.Номенклатура,
	|	МонтажТовары.ХарактеристикаНоменклатуры,
	|	МонтажТовары.СерияНоменклатуры,
	|	МонтажТовары.Ссылка.Результат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МонтажМатериалы.Номенклатура,
	|	МонтажМатериалы.ХарактеристикаНоменклатуры,
	|	МонтажМатериалы.СерияНоменклатуры,
	|	Значение(Перечисление.ВидыТабличнойЧасти.Материалы) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(МонтажМатериалы.Количество * МонтажМатериалы.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА МонтажМатериалы.Ссылка.Результат В (Значение(Справочник.РезультатыМонтажа.Выполнен), Значение(Справочник.РезультатыМонтажа.Закрыт))
	|			ТОГДА ЕСТЬNULL(СУММА(МонтажМатериалы.Количество * МонтажМатериалы.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|ИЗ
	|	Документ.Монтаж.Материалы КАК МонтажМатериалы
	|ГДЕ
	|   МонтажМатериалы.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	МонтажМатериалы.Номенклатура,
	|	МонтажМатериалы.ХарактеристикаНоменклатуры,
	|	МонтажМатериалы.СерияНоменклатуры,
	|	МонтажМатериалы.Ссылка.Результат
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//#13982
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТабличнойЧасти.Товары) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.ТекущийСтатус В (Значение(Справочник.СтатусыЗаказДоговоров.Выполнен))
	|			ТОГДА ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|
	|ПОМЕСТИТЬ ВТ_ПозицииЗД
	|
	|ИЗ
	|	Документ.ЗаказДоговор.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|   ДанныеДокумента.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Ссылка.ТекущийСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТабличнойЧасти.Материалы) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.Выполнен))
	|			ТОГДА ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|ИЗ
	|	Документ.ЗаказДоговор.Материалы КАК ДанныеДокумента
	|ГДЕ
	|   ДанныеДокумента.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Ссылка.ТекущийСтатус
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры,
	|	ВТ_Товары.СерияНоменклатуры,
	|	ВТ_Товары.ВидТабличнойЧасти,
	|	ЕСТЬNULL(ВТ_Товары.КРезервированию, 0) КАК КРезервированию,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.Количество, 0) + ЕСТЬNULL(ПозицииМонтажа.Количество, 0) + ЕСТЬNULL(ВТ_ПозицииЗД.Количество, 0) КАК ВЗаказе,
	|	ВЫБОР
	|		КОГДА &ЭтоЗаказПокупателя
	|			ТОГДА ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПозицииМонтажа.КоличествоОтгружено, 0) + ЕСТЬNULL(ВТ_ПозицииЗД.КоличествоОтгружено, 0)
	|	КОНЕЦ КАК Отгружено,
	|	ЕСТЬNULL(ТоварыВРезерве.УжеВРезерве, 0) КАК УжеВРезерве
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыЗаказаПокупателя КАК ЗаказПокупателяТовары
	|		ПО ВТ_Товары.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ЗаказПокупателяТовары.СерияНоменклатуры	
	|			И ВТ_Товары.ВидТабличнойЧасти = ЗаказПокупателяТовары.ВидТабличнойЧасти	
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииМонтажа КАК ПозицииМонтажа
	|		ПО ВТ_Товары.Номенклатура = ПозицииМонтажа.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ПозицииМонтажа.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ПозицииМонтажа.СерияНоменклатуры	
	|			И ВТ_Товары.ВидТабличнойЧасти = ПозицииМонтажа.ВидТабличнойЧасти
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииЗД КАК ВТ_ПозицииЗД
	|		ПО ВТ_Товары.Номенклатура = ВТ_ПозицииЗД.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ВТ_ПозицииЗД.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ВТ_ПозицииЗД.СерияНоменклатуры	
	|			И ВТ_Товары.ВидТабличнойЧасти = ВТ_ПозицииЗД.ВидТабличнойЧасти
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(
	|							,
	// #15038 добавлена граница: так как при наличии реализации, документ резервирования не проводится 
	|							&ДатаДокументаРезерва,
	|							,
	|							ЗаказНаПроизводство = &ДокументРезерва) КАК ЗаказыПокупателейОбороты
	|		ПО ВТ_Товары.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ЗаказыПокупателейОбороты.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ЗаказыПокупателейОбороты.СерияНоменклатуры
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыВРезерве КАК ТоварыВРезерве
	|		ПО ВТ_Товары.Номенклатура = ТоварыВРезерве.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ТоварыВРезерве.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ТоварыВРезерве.СерияНоменклатуры
	|			И ВТ_Товары.ВидТабличнойЧасти = ТоварыВРезерве.ВидТабличнойЧасти
	|";
	
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Отгружено = Макс(Выборка.Отгружено, 0);
		УжеВРезерве = Макс(Выборка.УжеВРезерве, 0);
		ДоступноКРезервированию = Выборка.ВЗаказе - Отгружено - УжеВРезерве;
		
		Если Выборка.КРезервированию > ДоступноКРезервированию Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
			НайденноеЗначение = Товары.НайтиСтроки(Отбор);
			Если НайденноеЗначение.Количество() > 0 Тогда
				Если ДоступноКРезервированию > 0 Тогда
					НайденноеЗначение[0].Количество = ДоступноКРезервированию;
				Иначе
					Товары.Удалить(НайденноеЗначение[0]);
				КонецЕсли;
			КонецЕсли;
			Если НайденноеЗначение.Количество() > 1 Тогда
				Для индекс = 1 по НайденноеЗначение.Количество()-1 Цикл
					Товары.Удалить(НайденноеЗначение[индекс]);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьНаличиеВДокументеРезерваИОтгрузкиСРезервами()
	
	КВозврату = Истина;
	
	ВТ_Товары = Товары.Выгрузить();
	Для Каждого ТекущаяСтрока Из ВТ_Товары Цикл
		ТекущаяСтрока.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
	КонецЦикла;
	ВТ_Товары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ВидТабличнойЧасти", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокументаРезерва", Дата);
	Запрос.УстановитьПараметр("Товары", ВТ_Товары);
	Запрос.УстановитьПараметр("ДокументРезерва", ДокументРезерва);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ЭтоЗаказПокупателя", ТипЗнч(ДокументРезерва) = Тип("ДокументСсылка.ЗаказПокупателя"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СерияНоменклатуры,
	|	Товары.ВидТабличнойЧасти,
	|	ЕСТЬNULL(Товары.Количество, 0) КАК КРезервированию
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВРезервеНаСкладах.Номенклатура,
	|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладах.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ТоварыВРезервеНаСкладах.КоличествоПриход), 0) - ЕСТЬNULL(СУММА(ТоварыВРезервеНаСкладах.КоличествоРасход), 0) КАК УжеВРезерве	
	|
	|ПОМЕСТИТЬ ВТ_ТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(,, Регистратор, ДокументРезерва = &ДокументРезерва) КАК ТоварыВРезервеНаСкладах
	|ГДЕ
	|   НЕ ТоварыВРезервеНаСкладах.Регистратор = &ТекущийДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладах.Номенклатура,
	|	ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладах.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладах.ВидТабличнойЧасти
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	Значение(Перечисление.ВидыТабличнойЧасти.Товары) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Коэффициент), 0) КАК Количество
	|
	|ПОМЕСТИТЬ ВТ_ТоварыЗаказаПокупателя
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|   ЗаказПокупателяТовары.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МонтажТовары.Номенклатура,
	|	МонтажТовары.ХарактеристикаНоменклатуры,
	|	МонтажТовары.СерияНоменклатуры,
	|	Значение(Перечисление.ВидыТабличнойЧасти.Товары) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(МонтажТовары.Количество * МонтажТовары.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА МонтажТовары.Ссылка.Результат В (Значение(Справочник.РезультатыМонтажа.Выполнен), Значение(Справочник.РезультатыМонтажа.Закрыт))
	|			ТОГДА ЕСТЬNULL(СУММА(МонтажТовары.Количество * МонтажТовары.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|
	|ПОМЕСТИТЬ ВТ_ПозицииМонтажа
	|
	|ИЗ
	|	Документ.Монтаж.ТоварыУслуги КАК МонтажТовары
	|ГДЕ
	|   МонтажТовары.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	МонтажТовары.Номенклатура,
	|	МонтажТовары.ХарактеристикаНоменклатуры,
	|	МонтажТовары.СерияНоменклатуры,
	|	МонтажТовары.Ссылка.Результат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МонтажМатериалы.Номенклатура,
	|	МонтажМатериалы.ХарактеристикаНоменклатуры,
	|	МонтажМатериалы.СерияНоменклатуры,
	|	Значение(Перечисление.ВидыТабличнойЧасти.Материалы) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(МонтажМатериалы.Количество * МонтажМатериалы.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА МонтажМатериалы.Ссылка.Результат В (Значение(Справочник.РезультатыМонтажа.Выполнен), Значение(Справочник.РезультатыМонтажа.Закрыт))
	|			ТОГДА ЕСТЬNULL(СУММА(МонтажМатериалы.Количество * МонтажМатериалы.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|ИЗ
	|	Документ.Монтаж.Материалы КАК МонтажМатериалы
	|ГДЕ
	|   МонтажМатериалы.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	МонтажМатериалы.Номенклатура,
	|	МонтажМатериалы.ХарактеристикаНоменклатуры,
	|	МонтажМатериалы.СерияНоменклатуры,
	|	МонтажМатериалы.Ссылка.Результат
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//#13982
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТабличнойЧасти.Товары) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.ТекущийСтатус В (Значение(Справочник.СтатусыЗаказДоговоров.Выполнен))
	|			ТОГДА ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|
	|ПОМЕСТИТЬ ВТ_ПозицииЗД
	|
	|ИЗ
	|	Документ.ЗаказДоговор.ТоварыУслуги КАК ДанныеДокумента
	|ГДЕ
	|   ДанныеДокумента.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Ссылка.ТекущийСтатус
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыТабличнойЧасти.Материалы) КАК ВидТабличнойЧасти,
	|	ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Ссылка.ТекущийСтатус В (ЗНАЧЕНИЕ(Справочник.СтатусыЗаказДоговоров.Выполнен))
	|			ТОГДА ЕСТЬNULL(СУММА(ДанныеДокумента.Количество * ДанныеДокумента.Коэффициент), 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОтгружено
	|ИЗ
	|	Документ.ЗаказДоговор.Материалы КАК ДанныеДокумента
	|ГДЕ
	|   ДанныеДокумента.Ссылка = &ДокументРезерва
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.Ссылка.ТекущийСтатус
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры,
	|	ВТ_Товары.СерияНоменклатуры,
	|	ВТ_Товары.ВидТабличнойЧасти,
	|	ЕСТЬNULL(ВТ_Товары.КРезервированию, 0) КАК КРезервированию,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.Количество, 0) + ЕСТЬNULL(ПозицииМонтажа.Количество, 0) + ЕСТЬNULL(ВТ_ПозицииЗД.Количество, 0) КАК ВЗаказе,
	|	ВЫБОР
	|		КОГДА &ЭтоЗаказПокупателя
	|			ТОГДА ЕСТЬNULL(ЗаказыПокупателейОбороты.КоличествоРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПозицииМонтажа.КоличествоОтгружено, 0) + ЕСТЬNULL(ВТ_ПозицииЗД.КоличествоОтгружено, 0)
	|	КОНЕЦ КАК Отгружено,
	|	ЕСТЬNULL(ТоварыВРезерве.УжеВРезерве, 0) КАК УжеВРезерве
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыЗаказаПокупателя КАК ЗаказПокупателяТовары
	|		ПО ВТ_Товары.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ЗаказПокупателяТовары.СерияНоменклатуры	
	|			И ВТ_Товары.ВидТабличнойЧасти = ЗаказПокупателяТовары.ВидТабличнойЧасти	
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииМонтажа КАК ПозицииМонтажа
	|		ПО ВТ_Товары.Номенклатура = ПозицииМонтажа.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ПозицииМонтажа.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ПозицииМонтажа.СерияНоменклатуры	
	|			И ВТ_Товары.ВидТабличнойЧасти = ПозицииМонтажа.ВидТабличнойЧасти
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииЗД КАК ВТ_ПозицииЗД
	|		ПО ВТ_Товары.Номенклатура = ВТ_ПозицииЗД.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ВТ_ПозицииЗД.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ВТ_ПозицииЗД.СерияНоменклатуры	
	|			И ВТ_Товары.ВидТабличнойЧасти = ВТ_ПозицииЗД.ВидТабличнойЧасти
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты(
	|							,
	// #15038 добавлена граница: так как при наличии реализации, документ резервирования не проводится 
	|							&ДатаДокументаРезерва,
	|							,
	|							ЗаказНаПроизводство = &ДокументРезерва) КАК ЗаказыПокупателейОбороты
	|		ПО ВТ_Товары.Номенклатура = ЗаказыПокупателейОбороты.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ЗаказыПокупателейОбороты.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ЗаказыПокупателейОбороты.СерияНоменклатуры
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыВРезерве КАК ТоварыВРезерве
	|		ПО ВТ_Товары.Номенклатура = ТоварыВРезерве.Номенклатура
	|			И ВТ_Товары.ХарактеристикаНоменклатуры = ТоварыВРезерве.ХарактеристикаНоменклатуры
	|			И ВТ_Товары.СерияНоменклатуры = ТоварыВРезерве.СерияНоменклатуры
	|			И ВТ_Товары.ВидТабличнойЧасти = ТоварыВРезерве.ВидТабличнойЧасти
	|";
	
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Отгружено = Макс(Выборка.Отгружено, 0);
		УжеВРезерве = Макс(Выборка.УжеВРезерве, 0);
		ДоступноКРезервированию = Выборка.ВЗаказе - Отгружено - УжеВРезерве;
		
		// Количество позиции больше чем в документе резерва
		Если Выборка.КРезервированию > Выборка.ВЗаказе Тогда
			КВозврату = Ложь;
			Сообщить("По """ + ПредставлениеНоменклатуры(Выборка) + """ указано большее количество к резервированию, чем в документе основании " + ДокументРезерва);
		ИначеЕсли Выборка.КРезервированию > ДоступноКРезервированию Тогда
			КВозврату = Ложь;
			Сообщить("По документу по позиции """ + ПредставлениеНоменклатуры(Выборка) + """ доступное количество к резерву " + Строка(ДоступноКРезервированию) + ?(Отгружено > 0, ", отгружено: " + Строка(Отгружено), "") + ?(УжеВРезерве > 0, ", уже зарезервировано: " + Строка(УжеВРезерве), ""));
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат КВозврату;
	
КонецФункции

Функция ПредставлениеНоменклатуры(Выборка)
	
	Возврат Строка(Выборка.Номенклатура) + ?(Выборка.ХарактеристикаНоменклатуры.Пустая(), "", ", Характеристика: " + Строка(Выборка.ХарактеристикаНоменклатуры)) + ?(Выборка.СерияНоменклатуры.Пустая(), "" , ", Серия: " + Строка(Выборка.СерияНоменклатуры));
	
КонецФункции

Функция ЕстьСписанныеРезервыПоДокументуРезерва()
	
	КВозврату = Ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервыПоставленные.Склад КАК Склад,
	|	РезервыПоставленные.Номенклатура КАК Номенклатура,
	|	РезервыПоставленные.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РезервыПоставленные.СерияНоменклатуры КАК СерияНоменклатуры,
	|	РезервыПоставленные.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	РезервыПоставленные.ДокументРезерва КАК ДокументРезерва,
	|	ЕСТЬNULL(РезервыСписанные.КоличествоПриход, 0) КАК КоличествоВРезервеВсего,
	|	РезервыПоставленные.КоличествоПриход КАК КоличествоВРезервеТекущимДокументом,
	|	ЕСТЬNULL(РезервыСписанные.КоличествоРасход, 0) КАК КоличествоСписанныхРезервов,
	|	-(ЕСТЬNULL(РезервыСписанные.КоличествоПриход, 0) - РезервыПоставленные.КоличествоПриход - ЕСТЬNULL(РезервыСписанные.КоличествоРасход, 0)) КАК СписаноТекущимДокументом
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(, , Авто, ) КАК РезервыПоставленные
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты() КАК РезервыСписанные
	|		ПО РезервыПоставленные.Склад = РезервыСписанные.Склад
	|			И РезервыПоставленные.Номенклатура = РезервыСписанные.Номенклатура
	|			И РезервыПоставленные.ХарактеристикаНоменклатуры = РезервыСписанные.ХарактеристикаНоменклатуры
	|			И РезервыПоставленные.СерияНоменклатуры = РезервыСписанные.СерияНоменклатуры
	|			И РезервыПоставленные.ВидТабличнойЧасти = РезервыСписанные.ВидТабличнойЧасти
	|			И РезервыПоставленные.ДокументРезерва = РезервыСписанные.ДокументРезерва
	|
	|ГДЕ
	|	РезервыПоставленные.Регистратор = &Ссылка
	|	И -(ЕСТЬNULL(РезервыСписанные.КоличествоПриход, 0) - РезервыПоставленные.КоличествоПриход - ЕСТЬNULL(РезервыСписанные.КоличествоРасход, 0)) > 0
	|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КВозврату = Истина;
		
		Сообщить(СтрШаблон("По %1, по позиции %2%3%4 уже списаны резервы."
			, Выборка.ДокументРезерва
			, Выборка.Номенклатура
			, ?(ЗначениеЗаполнено(Выборка.Характеристика), ", " + Выборка.Характеристика, "") 
			, ?(ЗначениеЗаполнено(Выборка.СерияНоменклатуры), ", " + Выборка.СерияНоменклатуры, "")
		));
		
	КонецЦикла;
	
	Возврат КВозврату;
	
КонецФункции

#КонецОбласти
